site-backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Massimo"], ["bio", "Salut"], ["created_at", "2018-04-26 11:56:06.373880"], ["updated_at", "2018-04-26 11:56:06.373880"]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def new_post  # Se déclenche à l'envoi du FORM
    @user = User.new  # On lance la création d'un nouvel User
    @user.username = params[:username]  # On sélectionne la value associée au pseudo
    @user.bio = params[:bio]  # On sélectionne ensuite la bio
    @user.save  # On enregistre le nouvel User
      if @user == User.last  # On teste si l'enregistrement est réussi